# CitySet Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
CitySet Class
Members See Also
---
An set that contains cities.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class CitySet : APIObject, IEnumerable
```

Visual Basic
---
```text
Public Class CitySet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class CitySet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..CitySet
# See Also
CitySet Members
Autodesk.Revit.DB Namespace